##sNew = sOld.replace(what, with)
## if 'word'.endswith(('a', 'b', 'c')) - двойные скобочки

## Модули:
##math - матем. функции
##os, shutil - работа с файловой системой
##datetime - работа с датами и временем
##random
##urllib2 - загрузка страниц из интернета
##xml.dom - извлечь инф. из xml
##codecs - работа с кодировками
##re - регулярные выражения
##Бэкслэш - экранирующий символ
##\t - tab
##\n - перенос строки
##\r
##\\ - экранировать бэкслэш
##r'home\user\file.txt - raw string (обычный символ, а не специальный)
##
## Регулярные выражения - re (import re)
## H(ae?|e)ndel найдет handel haendel hendel

## - match - то, что подходит под регулярное выражение
## Муаммар Каддафи
## M(u|ou?)'?a?mm?ar ((A|a|E|e)l)?-? (Q|G|Kh?)a(d(d|h(dh)?)|th|zz)aff?(i|y)

## в скобках - group (a|b|c)
## . - один символ
## ? - пред. символа может не быть
## | - ИЛИ
## * - пред. символ или группа встречаются любое кол-во раза
## + - пред. символ встречается больше нуля раз
## .* - любое кол-во любых символов

## [ABC] - A, B ИЛИ С
## [A-П] - от А до П (больших) сначала большие, потом маленькие
## все буквы русского алфавита: [А-Яа-яЁё] или можно [А-Кb-lz]
## бэкслэш и др. метасимволы [F-N]+\?     \\\\ - бэкслэш как обычный символ в рег. выражениях
## регулярные выражения - строки, поэтому в кавычках


